Catalogs/КомбинацииПроизводственныхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КомбинацииПроизводственныхГрупп</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КомбинацииПроизводственныхГрупп/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Нормализация.
	МассивОснований = Состав.ВыгрузитьКолонку("Основание");
	
	// Поиск.
	Поиск = Строка(Неопределено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеГруппы.Поиск КАК Поиск
	                      |ИЗ
	                      |	Справочник.ПроизводственныеГруппы КАК ПроизводственныеГруппы
	                      |ГДЕ
	                      |	ПроизводственныеГруппы.Ссылка В(&Основания)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Поиск");
	Запрос.УстановитьПараметр("Основания", МассивОснований);						  
	Выборка = Запрос.Выполнить().Выбрать();						  
	Первая = Истина; Пока Выборка.Следующий() Цикл
		Поиск = Поиск + Выборка.Поиск;
	КонецЦикла;
						  
	// Наименование и пометка удаления.
	Наименование = Строка(Неопределено); ПометкаУдаления = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеГруппы.Наименование КАК Наименование,
	                      |	ПроизводственныеГруппы.ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ПроизводственныеГруппы КАК ПроизводственныеГруппы
	                      |ГДЕ
	                      |	ПроизводственныеГруппы.Ссылка В(&Основания)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Запрос.УстановитьПараметр("Основания", МассивОснований);						  
	Выборка = Запрос.Выполнить().Выбрать();						  
	Первая = Истина; Пока Выборка.Следующий() Цикл
		Если Первая Тогда
			Наименование = Выборка.Наименование; Первая = Ложь;
		Иначе
			Наименование = Наименование + ", " + Выборка.Наименование; Первая = Ложь;
		КонецЕсли;
		ПометкаУдаления = ПометкаУдаления Или Выборка.ПометкаУдаления;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПередЗаписью()
